{
  "chapters": [
    {
      "id": 1,
      "title": "CHAPTER I",
      "pages": [
        {
          "id": 1,
          "content": "There were three of them—Jerry, Jimmy, and Kathleen. Of course, Jerry's name was Gerald, and not Jeremiah, whatever you may think; and Jimmy's name was James; and Kathleen was never called by her name at all, but Cathy, or Catty, or Puss Cat, when her brothers were pleased with her, and Scratch Cat when they were not pleased. And they were at school in a little town in the West of England—the boys at one school, of course, and the girl at another, because the sensible habit of having boys and girls at the same school is not yet as common as I hope it will be some day. They used to see each other on Saturdays and Sundays at the house of a kind maiden lady; but it was one of those houses where it is impossible to play. You know the kind of house, don't you? There is a sort of a something about that kind of house that makes you hardly able even to talk to each other when you are left alone, and playing seems unnatural and affected. So they looked forward to the holidays, when they should all go home and be together all day long, in a house where playing was natural and conversation possible, and where the Hampshire forests and fields were full of interesting things to do and see. Their Cousin Betty was to be there too, and there were plans. Betty's school broke up before theirs, and so she got to the Hampshire home first, and the moment she got there she began to have measles, so that my three couldn't go home at all. You may imagine their feelings. The thought of seven weeks at Miss Hervey's was not to be borne, and all three wrote home and said so. This astonished their parents very much, because they had always thought it was so nice for the children to have dear Miss Hervey's to go to. However, they were \"jolly decent about it,\" as Jerry said, and after a lot of letters and telegrams, it was arranged that the boys should go and stay at Kathleen's school, where there were now no girls left and no mistresses except the French one.",
          "chapter": "CHAPTER I",
          "type": "text"
        },
        {
          "id": 2,
          "content": "\"It'll be better than being at Miss Hervey's,\" said Kathleen, when the boys came round to ask Mademoiselle when it would be convenient for them to come; \"and, besides, our school's not half so ugly as yours. We do have tablecloths on the tables and curtains at the windows, and yours is all deal boards, and desks, and inkiness.\"\n\nWhen they had gone to pack their boxes Kathleen made all the rooms as pretty as she could with flowers in jam jars, marigolds chiefly, because there was nothing much else in the back garden. There were geraniums in the front garden, and calceolarias and lobelias; of course, the children were not allowed to pick these.",
          "chapter": "CHAPTER I",
          "type": "text"
        },
        {
          "id": 3,
          "content": "\"We ought to have some sort of play to keep us going through the holidays,\" said Kathleen, when tea was over, and she had unpacked and arranged the boys' clothes in the painted chests of drawers, feeling very grown-up and careful as she neatly laid the different sorts of clothes in tidy little heaps in the drawers. \"Suppose we write a book.\"\n\n\"You couldn't,\" said Jimmy.\n\n\"I didn't mean me, of course,\" said Kathleen, a little injured; \"I meant us.\"\n\n\"Too much fag,\" said Gerald briefly.\n\n\"If we wrote a book,\" Kathleen persisted, \"about what the insides of schools really are like, people would read it and say how clever we were.\"",
          "chapter": "CHAPTER I",
          "type": "text"
        },
        {
          "id": 4,
          "content": "\"More likely expel us,\" said Gerald. \"No; we'll have an out-of-doors game—bandits, or something like that. It wouldn't be bad if we could get a cave and keep stores in it, and have our meals there.\"\n\n\"I dare say,\" said Jimmy. \"And be caught by the police.\"",
          "chapter": "CHAPTER I",
          "type": "comic",
          "illustrationId": "ch01_01_bandit_proposal",
          "caption": "",
          "dialogue": [
            "\"More likely expel us,\" said Gerald. \"No; we'll have an out-of-doors game—bandits, or something like that. It wouldn't be bad if we could get a cave and keep stores in it, and have our meals there.\"",
            "\"I dare say,\" said Jimmy. \"And be caught by the police.\""
          ]
        },
        {
          "id": 5,
          "content": "\"There aren't any caves,\" said Jimmy, who was fond of contradicting every one. \"And, besides, your precious Mamselle won't let us go out alone, as likely as not.\"",
          "chapter": "CHAPTER I",
          "type": "comic",
          "illustrationId": "ch01_02_jimmy_sarcasm",
          "caption": "",
          "dialogue": [
            "\"There aren't any caves,\" said Jimmy, who was fond of contradicting every one. \"And, besides, your precious Mamselle won't let us go out alone, as likely as not.\""
          ]
        },
        {
          "id": 6,
          "content": "\"Oh, we'll see about that,\" said Gerald. \"I'll go and talk to her like a father.\"\n\n\"Like that?\" Kathleen pointed the thumb of scorn at him, and he looked in the glass.\n\n\"To brush his hair and his clothes and to wash his face and hands was to our hero but the work of a moment,\" said Gerald, and went to suit the action to the word.\n\nIt was a very sleek boy, brown and thin and interesting-looking, that knocked at the door of the parlour where Mademoiselle sat reading a yellow-covered book and wishing vain wishes. Gerald could always make himself look interesting at a moment's notice, a very useful accomplishment in dealing with strange grown-ups. It was done by opening the eyes quite wide and looking rather pathetic.\n\n\"Entrez!\" said Mademoiselle, in a sharp, sudden voice, and Gerald entered.",
          "chapter": "CHAPTER I",
          "type": "text"
        },
        {
          "id": 7,
          "content": "\"Eh bien?\" she said impatiently.\n\n\"I've come to ask,\" said Gerald, \"if we may go out for a walk.\"",
          "chapter": "CHAPTER I",
          "type": "comic",
          "illustrationId": "ch01_03_charming_mademoiselle",
          "caption": "",
          "dialogue": [
            "\"Eh bien?\" she said impatiently.",
            "\"I've come to ask,\" said Gerald, \"if we may go out for a walk.\""
          ]
        },
        {
          "id": 8,
          "content": "\"How can you go out?\" said Mademoiselle, ruffling the pages of her book. \"I am not arranged to take you out, and I cannot permit that you go alone. The world is full of wicked people who steal children.\"\n\n\"We aren't worth stealing,\" said Gerald, with a smile that he tried to make winning, but which only succeeded in being sheepish.\n\n\"We're not babies,\" he added; \"we're all over twelve.\"\n\n\"It is all the same,\" said Mademoiselle; \"you will not go out.\"\n\nShe went on reading, and Gerald went back to the others.\n\n\"It's no go,\" he said; \"she says the world is full of wicked people who steal children.\"\n\n\"I wish they would steal her,\" said Jimmy; \"then we shouldn't have to be bothered with her.\"\n\n\"I'll try again,\" said Kathleen; \"I'll say we'll only go into the garden.\"",
          "chapter": "CHAPTER I",
          "type": "text"
        },
        {
          "id": 9,
          "content": "She went, and returned triumphant.\n\n\"She says we may go into the garden, but we're not to go outside the gate. And we're not to make a noise. And we're not to pick the flowers. And we're not to walk on the grass. And we're not to climb the trees.\"\n\n\"Is there anything we may do?\" asked Jimmy.\n\n\"We may breathe,\" said Kathleen, \"if we do it quietly.\"\n\nThey went out into the garden. It was a long, narrow garden, with a high wall all round it. There was a grass plot in the middle, and a gravel path all round. There were flower-beds against the walls, and a few trees—lilacs and laburnums—at the end.\n\n\"It's like a prison,\" said Jimmy.\n\n\"Let's play prisoners,\" said Kathleen.\n\n\"We are prisoners,\" said Gerald; \"it's no use playing what you are. Let's play escaping from prison.\"",
          "chapter": "CHAPTER I",
          "type": "text"
        },
        {
          "id": 10,
          "content": "\"How can we?\" asked Jimmy. \"The walls are too high.\"\n\n\"We could get over the wall at the end,\" said Gerald; \"there's a tree there that would help.\"\n\n\"But we mustn't climb trees,\" said Kathleen.\n\n\"We aren't climbing trees,\" said Gerald; \"we're escaping from prison. Prisoners have to do things they aren't allowed to do. That's the whole point.\"\n\nThey went to the end of the garden. The wall there was lower than at the sides, and there was a big elder tree that grew close to it.\n\n\"I'll go first,\" said Gerald. He climbed up the tree and looked over the wall.\n\n\"Hullo!\" he cried.\n\n\"What is it?\" asked the others.",
          "chapter": "CHAPTER I",
          "type": "text"
        },
        {
          "id": 11,
          "content": "\"It's a cave,\" said Gerald. \"A real cave. It looks like the entrance to an enchanted castle.\"",
          "chapter": "CHAPTER I",
          "type": "comic",
          "illustrationId": "ch01_04_cave_discovery",
          "caption": "",
          "dialogue": [
            "\"It's a cave,\" said Gerald. \"A real cave. It looks like the entrance to an enchanted castle.\""
          ]
        },
        {
          "id": 12,
          "content": "\"Let me look,\" said Jimmy, scrambling up.\n\n\"Me too,\" said Kathleen.\n\nThey all looked. On the other side of the wall was a wood—a real, thick, dark wood. And in the middle of the wood, just opposite the place where they were looking, was a dark opening in the ground, half hidden by ferns and brambles.\n\n\"It is a cave,\" said Kathleen. \"Oh, let's go and explore it.\"\n\n\"What about Mamselle?\" asked Jimmy.\n\n\"She'll never know,\" said Gerald. \"We can be back before tea. Come on.\"\n\nHe dropped from the wall into the wood, and the others followed him. They found themselves in a deep, green twilight. The trees were so thick that hardly any sunlight could get through. The ground was covered with soft moss and dead leaves.\n\n\"It's just like a story-book,\" said Kathleen.",
          "chapter": "CHAPTER I",
          "type": "text"
        },
        {
          "id": 13,
          "content": "They went towards the cave. It was a low, arched opening in a bank of earth. Ferns hung down over it, and ivy grew all round it.\n\n\"Shall we go in?\" asked Jimmy.\n\n\"Of course,\" said Gerald. \"That's what we came for.\"\n\nHe stooped down and crept into the cave. The others followed. Inside it was dark and cool and smelt of damp earth.\n\n\"I've got a candle end in my pocket,\" said Gerald. \"I always carry one in case of emergencies.\"\n\nHe lighted the candle, and they saw that they were in a long, low passage. The walls were made of stone, and the roof was arched.",
          "chapter": "CHAPTER I",
          "type": "text"
        },
        {
          "id": 14,
          "content": "\"It's a secret passage,\" said Kathleen. \"I knew it was an enchanted castle.\"",
          "chapter": "CHAPTER I",
          "type": "comic",
          "illustrationId": "ch01_05_secret_passage",
          "caption": "",
          "dialogue": [
            "\"It's a secret passage,\" said Kathleen. \"I knew it was an enchanted castle.\""
          ]
        },
        {
          "id": 15,
          "content": "They walked along the passage for what seemed a long time. It went down and down, and then it began to go up again. At last they saw a glimmer of light ahead.\n\n\"There's the end,\" said Jimmy.\n\nThey hurried on, and came out into the dazzling sunlight. They were in a beautiful garden—much more beautiful than the one they had left. There were fountains playing, and peacocks walking on the lawns, and statues standing among the flowers. And in the middle of the garden stood a great white castle, with towers and turrets and flags flying from the battlements.",
          "chapter": "CHAPTER I",
          "type": "text"
        },
        {
          "id": 16,
          "content": "\"It is an enchanted castle,\" said Gerald. \"I told you so.\"",
          "chapter": "CHAPTER I",
          "type": "comic",
          "illustrationId": "ch01_06_castle_discovery",
          "caption": "",
          "dialogue": [
            "\"It is an enchanted castle,\" said Gerald. \"I told you so.\""
          ]
        },
        {
          "id": 17,
          "content": "They stood and looked at it in silence. It was so beautiful that it took their breath away.\n\n\"I wonder who lives there,\" said Kathleen.\n\n\"A princess, of course,\" said Gerald. \"Or a giant. Or a magician.\"\n\n\"Let's go and see,\" said Jimmy.\n\nThey walked across the grass towards the castle. As they came nearer, they saw that the castle was not quite as perfect as it had looked from a distance. Some of the windows were broken, and there was moss growing on the steps.\n\n\"It looks deserted,\" said Kathleen.\n\n\"All the better,\" said Gerald. \"We can explore it properly.\"",
          "chapter": "CHAPTER I",
          "type": "text"
        },
        {
          "id": 18,
          "content": "They went up the steps and pushed open the great oak door. It creaked on its hinges, as if it hadn't been opened for a hundred years. They found themselves in a great hall, with a high roof and a stone floor. There were suits of armour standing against the walls, and old banners hanging from the roof.\n\n\"It's like a museum,\" said Jimmy.\n\n\"It's like a dream,\" said Kathleen.\n\n\"It's an adventure,\" said Gerald. \"Come on, let's see what's upstairs.\"\n\nThey went up the broad staircase, their footsteps echoing in the silence. They went through room after room, all furnished with beautiful old furniture, but all dusty and neglected.\n\n\"There's no one here,\" said Jimmy. \"It's empty.\"\n\n\"I'm not so sure,\" said Gerald. \"I feel as if someone were watching us.\"",
          "chapter": "CHAPTER I",
          "type": "text"
        },
        {
          "id": 19,
          "content": "\"Don't say that,\" said Kathleen. \"You frighten me.\"\n\n\"I'm not frightened,\" said Jimmy. \"I'm hungry. I wish we'd brought some grub.\"\n\n\"There might be a banquet spread in one of the rooms,\" said Gerald. \"That's what always happens in enchanted castles.\"\n\nThey went on exploring, but they found no banquet. At last they came to a room at the top of a tower. It was a round room, with windows looking out in all directions. In the middle of the room was a table, and on the table was a ring.",
          "chapter": "CHAPTER I",
          "type": "text"
        },
        {
          "id": 20,
          "content": "\"Look!\" cried Kathleen. \"A ring!\"\n\n\"It's a magic ring,\" said Gerald. \"I bet it is.\"",
          "chapter": "CHAPTER I",
          "type": "comic",
          "illustrationId": "ch01_07_finding_ring",
          "caption": "",
          "dialogue": [
            "\"Look!\" cried Kathleen. \"A ring!\"",
            "\"It's a magic ring,\" said Gerald. \"I bet it is.\""
          ]
        },
        {
          "id": 21,
          "content": "He picked it up. It was a heavy gold ring, with a strange design carved on it.\n\n\"Put it on,\" said Jimmy.\n\n\"I don't know if I ought to,\" said Gerald. \"It might turn me into a frog or something.\"\n\n\"Rubbish,\" said Jimmy. \"Put it on.\"\n\nGerald put the ring on his finger.\n\n\"Well?\" said Kathleen. \"Do you feel any different?\"\n\n\"No,\" said Gerald. \"I feel just the same.\"\n\n\"I told you it was all rot,\" said Jimmy. \"It's just an old ring.\"\n\n\"Wait a minute,\" said Gerald. \"I see something written inside.\"\n\nHe took the ring off and looked at the inside.\n\n\"It says 'Voeu' something,\" he said. \"I can't make it out.\"\n\n\"Let me see,\" said Kathleen.\n\nShe took the ring and looked at it.\n\n\"It says 'Voeu exaucé',\" she said. \"That's French. It means 'Wish granted'.\"",
          "chapter": "CHAPTER I",
          "type": "text"
        },
        {
          "id": 22,
          "content": "\"Wish granted!\" cried Gerald. \"Then it is a magic ring! Quick, wish for something!\"\n\n\"I wish we had a banquet,\" said Jimmy.\n\n\"I wish we were invisible,\" said Gerald.\n\n\"I wish we were back at school,\" said Kathleen.\n\nThey all spoke at once. And then—\n\nBut what happened then is another story. This is only the beginning of the adventures of the three children in the Enchanted Castle.",
          "chapter": "CHAPTER I",
          "type": "text"
        }
      ]
    },
    {
      "id": 2,
      "title": "CHAPTER II",
      "pages": [
        {
          "id": 23,
          "content": "The Princess went first, and Kathleen carried her shining train; then came Jimmy, and Gerald came last. They were all quite sure that they had walked right into the middle of a fairy tale, and they were very ready to play the parts of the three heroes.\n\n\"But,\" said Gerald, \"I don't see how we can play the parts if we don't know what the story is.\"\n\n\"We shall find out as we go along,\" said the Princess. \"That's the best of this game. You never know what's going to happen next.\"\n\nThey went through the great hall and up the broad staircase. The Princess led the way to a room that was quite different from the others. It was not dusty or neglected. There were fresh flowers in the vases, and a fire burned on the hearth, for though it was summer the room was cool.",
          "chapter": "CHAPTER II",
          "type": "text"
        },
        {
          "id": 24,
          "content": "\"This is my bower,\" said the Princess. \"Here we can talk.\"\n\nShe sat down on a low chair, and the others sat on the floor.",
          "chapter": "CHAPTER II",
          "type": "comic",
          "illustrationId": "ch02_01_princess_bower",
          "caption": "",
          "dialogue": [
            "\"This is my bower,\" said the Princess. \"Here we can talk.\"",
            "She sat down on a low chair, and the others sat on the floor."
          ]
        },
        {
          "id": 25,
          "content": "\"Now,\" she said, \"I'll tell you the story. I am the Princess of this castle. I am kept here by a wicked enchanter. He is invisible to every one but me. He comes every day to see that I am safe.\"\n\n\"What does he do?\" asked Jimmy.\n\n\"He just looks at me,\" said the Princess, \"and then he goes away. But I know he is there. Sometimes I feel his cold breath on my cheek.\"\n\n\"How horrid!\" said Kathleen.\n\n\"Yes,\" said the Princess. \"But I have a friend who is a good fairy. She gave me this ring. She said that if I ever found three children who were brave and true, I was to give them the ring, and they would save me.\"\n\n\"We are brave and true,\" said Gerald. \"At least, I hope so.\"",
          "chapter": "CHAPTER II",
          "type": "text"
        },
        {
          "id": 26,
          "content": "\"Then,\" said the Princess, \"you must take the ring and wear it. But you must be careful. It is a magic ring, and it has great power. If you use it wrongly, it may bring you bad luck.\"\n\n\"We'll be careful,\" said Gerald. \"But what does it do?\"",
          "chapter": "CHAPTER II",
          "type": "comic",
          "illustrationId": "ch02_02_ring_explanation",
          "caption": "",
          "dialogue": [
            "\"Then,\" said the Princess, \"you must take the ring and wear it. But you must be careful. It is a magic ring, and it has great power. If you use it wrongly, it may bring you bad luck.\"",
            "\"We'll be careful,\" said Gerald. \"But what does it do?\""
          ]
        },
        {
          "id": 27,
          "content": "\"It grants wishes,\" said the Princess. \"But only one wish to each person. And you must wish for something unselfish.\"\n\n\"That's easy,\" said Kathleen. \"I wish you were free from the enchanter.\"\n\nThe Princess smiled. \"That is a good wish,\" she said. \"But you must wait until the right time. The enchanter is very powerful. We must catch him when he is off his guard.\"\n\n\"When will that be?\" asked Jimmy.\n\n\"I don't know,\" said the Princess. \"But we must watch and wait.\"\n\nThey talked for a long time, planning how they would defeat the enchanter. The Princess told them many things about the castle—about the secret passages, and the hidden treasures, and the ghosts that walked at night.\n\n\"Ghosts!\" said Jimmy. \"I don't believe in ghosts.\"",
          "chapter": "CHAPTER II",
          "type": "text"
        },
        {
          "id": 28,
          "content": "\"You will when you see them,\" said the Princess. \"They are very real here.\"\n\nSuddenly a bell rang somewhere in the castle.\n\n\"That is the dinner bell,\" said the Princess. \"You must go now. If the enchanter finds you here, he will be very angry.\"\n\n\"But we haven't saved you yet,\" said Gerald.\n\n\"You will,\" said the Princess. \"Come back to-morrow. I will be waiting for you.\"\n\nShe led them down a secret staircase that ended in the garden.\n\n\"Good-bye,\" said the Princess. \"Remember the ring.\"\n\n\"We will,\" said the others.",
          "chapter": "CHAPTER II",
          "type": "text"
        },
        {
          "id": 29,
          "content": "They walked back through the wood in silence. They were all thinking about the Princess and the magic ring.",
          "chapter": "CHAPTER II",
          "type": "comic",
          "illustrationId": "ch02_03_post_adventure_reflection",
          "caption": "",
          "dialogue": [
            "They walked back through the wood in silence. They were all thinking about the Princess and the magic ring."
          ]
        },
        {
          "id": 30,
          "content": "\"It's a splendid game,\" said Kathleen. \"I almost believe it's true.\"\n\n\"Of course it's true,\" said Gerald. \"Look at the ring.\"\n\nHe held up his hand. The ring was still there, shining in the sunlight.\n\n\"I wonder what we shall wish for,\" said Jimmy.\n\n\"We must wait,\" said Gerald. \"The Princess said so.\"\n\nWhen they got back to the school, Mademoiselle was looking for them.\n\n\"Where have you been?\" she asked. \"You are late for tea.\"\n\n\"We've been in the garden,\" said Gerald. \"We fell asleep.\"\n\n\"You must not sleep in the garden,\" said Mademoiselle. \"It is damp. You will catch cold.\"\n\n\"We are quite well,\" said Kathleen. \"And we are very hungry.\"\n\nThey had a good tea, and then they went up to the dormitory to talk about their adventure.",
          "chapter": "CHAPTER II",
          "type": "text"
        },
        {
          "id": 31,
          "content": "\"I think the Princess is Mabel,\" said Kathleen. \"You know, the girl who lives at the lodge.\"\n\n\"She didn't look like Mabel,\" said Jimmy. \"She looked like a real princess.\"\n\n\"That's the magic,\" said Gerald. \"It makes everything look different.\"\n\n\"I wonder if the ring really works,\" said Jimmy. \"I've a good mind to try it.\"\n\n\"No, don't,\" said Gerald. \"You might spoil everything. We must do exactly what the Princess said.\"\n\nSo they decided to wait until the next day. But they were very excited, and it was a long time before they could go to sleep.\n\nAnd that is the end of the second chapter.",
          "chapter": "CHAPTER II",
          "type": "text"
        }
      ]
    }
  ]
}
